---
title: FamilyTypeSet
classe: Autodesk.Revit.DB.FamilyTypeSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# FamilyTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `familyTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `familyTypeSet.Size` | Int32 |
| `Void Clear()` | `familyTypeSet.Clear()` | Void |
| `Boolean Contains(FamilyType)` | `familyTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(FamilyType)` | `familyTypeSet.Erase(item)` | Int32 |
| `FamilyTypeSetIterator ForwardIterator()` | `familyTypeSet.ForwardIterator()` | FamilyTypeSetIterator |
| `IEnumerator GetEnumerator()` | `familyTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(FamilyType)` | `familyTypeSet.Insert(item)` | Boolean |
| `FamilyTypeSetIterator ReverseIterator()` | `familyTypeSet.ReverseIterator()` | FamilyTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```